Tekla Open API Reference for Tekla Structures 2025
RebarItem.CrankExtraOffset Property
 Gets or sets the crank extra offset.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double CrankExtraOffset { get; set; }
Public Property CrankExtraOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace